# Curso ML con Python
## Limpieza de Datos

### 1º Trabajando con DB Titanic

In [1]:
import pandas as pd

**Carga de Datos a través de la función read_csv**

In [2]:
df = pd.read_csv("../Dataset/titanic/titanic3.csv")

In [4]:
df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [8]:
df.groupby